Revit 2024 API
SymbolTypeId.KgfDashM Property
 Symbol kgf-m, indicating unit Kilogram force meters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId KgfDashM { get; }
Visual Basic
Public Shared ReadOnly Property KgfDashM As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ KgfDashM {
	ForgeTypeId^ get ();
}
See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace